In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib as mpl
from scipy.stats import stats
import warnings
warnings.filterwarnings("ignore")
from scipy.stats.stats import pearsonr
%matplotlib inline

from itertools import chain

In [2]:
stats = pd.read_csv('MDG_Export_20191227 (1).csv')
stats.head(3)

,CountryCode,Country,SeriesCode,MDG,Series,1990,Footnotes,Type,1991,Footnotes.1,...,Type.26,2017,Footnotes.27,Type.27,2018,Footnotes.28,Type.28,2019,Footnotes.29,Type.29
0,4,Afghanistan,567,Y,"Proportion of land area covered by forest, per...",2.1,NaN,E,,,...,,,,,,,,,,
1,4,Afghanistan,749,Y,"Carbon dioxide emissions (CO2), thousand metri...",2676.9,NaN,G,2493.6,NaN,...,,,,,,,,,,
2,4,Afghanistan,616,Y,Terrestrial and marine areas protected to tota...,0.36,NaN,C,,,...,,,,,,,,,,

In [3]:
stats.shape

(690, 95)

In [4]:
stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690 entries, 0 to 689
Data columns (total 95 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CountryCode   690 non-null    int64
 1   Country       690 non-null    object
 2   SeriesCode    690 non-null    int64
 3   MDG           690 non-null    object
 4   Series        690 non-null    object
 5   1990          689 non-null    object
 6   Footnotes     67 non-null     object
 7   Type          690 non-null    object
 8   1991          690 non-null    object
 9   Footnotes.1   508 non-null    object
 10  Type.1        690 non-null    object
 11  1992          690 non-null    object
 12  Footnotes.2   486 non-null    object
 13  Type.2        690 non-null    object
 14  1993          690 non-null    object
 15  Footnotes.3   486 non-null    object
 16  Type.3        690 non-null    object
 17  1994          690 non-null    object
 18  Footnotes.4   485 non-null    object
 19  Type.4        690 non-null    object
 20  1995          690 non-null    object
 21  Footnotes.5   483 non-null    object
 22  Type.5        690 non-null    object
 23  1996          690 non-null    object
 24  Footnotes.6   484 non-null    object
 25  Type.6        690 non-null    object
 26  1997          690 non-null    object
 27  Footnotes.7   481 non-null    object
 28  Type.7        690 non-null    object
 29  1998          690 non-null    object
 30  Footnotes.8   481 non-null    object
 31  Type.8        690 non-null    object
 32  1999          690 non-null    object
 33  Footnotes.9   481 non-null    object
 34  Type.9        690 non-null    object
 35  2000          689 non-null    object
 36  Footnotes.10  38 non-null     object
 37  Type.10       690 non-null    object
 38  2001          690 non-null    object
 39  Footnotes.11  479 non-null    object
 40  Type.11       690 non-null    object
 41  2002          690 non-null    object
 42  Footnotes.12  478 non-null    object
 43  Type.12       690 non-null    object
 44  2003          690 non-null    object
 45  Footnotes.13  478 non-null    object
 46  Type.13       690 non-null    object
 47  2004          690 non-null    object
 48  Footnotes.14  478 non-null    object
 49  Type.14       690 non-null    object
 50  2005          689 non-null    object
 51  Footnotes.15  258 non-null    object
 52  Type.15       690 non-null    object
 53  2006          690 non-null    object
 54  Footnotes.16  476 non-null    object
 55  Type.16       690 non-null    object
 56  2007          690 non-null    object
 57  Footnotes.17  475 non-null    object
 58  Type.17       690 non-null    object
 59  2008          690 non-null    object
 60  Footnotes.18  475 non-null    object
 61  Type.18       690 non-null    object
 62  2009          690 non-null    object
 63  Footnotes.19  475 non-null    object
 64  Type.19       690 non-null    object
 65  2010          689 non-null    object
 66  Footnotes.20  256 non-null    object
 67  Type.20       690 non-null    object
 68  2011          690 non-null    object
 69  Footnotes.21  475 non-null    object
 70  Type.21       690 non-null    object
 71  2012          690 non-null    object
 72  Footnotes.22  690 non-null    object
 73  Type.22       690 non-null    object
 74  2013          690 non-null    object
 75  Footnotes.23  690 non-null    object
 76  Type.23       690 non-null    object
 77  2014          690 non-null    object
 78  Footnotes.24  467 non-null    object
 79  Type.24       690 non-null    object
 80  2015          690 non-null    object
 81  Footnotes.25  690 non-null    object
 82  Type.25       690 non-null    object
 83  2016          690 non-null    object
 84  Footnotes.26  690 non-null    object
 85  Type.26       690 non-null    object
 86  2017          690 non-null    object
 87  Footnotes.27  690 non-null    object
 88  Type.27       690 non-null    object
 89  2018          690 non-null    object
 90  Footnotes.28  690 non-null    object
 91  Type.28       690 non-null    object
 92  2019          690 non-null    object
 93  Footnotes.29  690 non-null    object
 94  Type.29       690 non-null    object
dtypes: int64(2), object(93)
memory usage: 512.2+ KB

In [5]:
stats.describe()

       CountryCode  SeriesCode
count   690.000000  690.000000
mean    439.465217  644.000000
std     254.138802   76.949647
min       4.000000  567.000000
25%     222.000000  567.000000
50%     439.000000  616.000000
75%     660.000000  749.000000
max     894.000000  749.000000

In [6]:
#checking data type columns
stats.columns.to_series().groupby(stats.dtypes).groups

{dtype('int64'): Index(['CountryCode', 'SeriesCode'], dtype='object'),
 dtype('O'): Index(['Country', 'MDG', 'Series', '1990', 'Footnotes', 'Type', '1991',
        'Footnotes.1', 'Type.1', '1992', 'Footnotes.2', 'Type.2', '1993',
        'Footnotes.3', 'Type.3', '1994', 'Footnotes.4', 'Type.4', '1995',
        'Footnotes.5', 'Type.5', '1996', 'Footnotes.6', 'Type.6', '1997',
        'Footnotes.7', 'Type.7', '1998', 'Footnotes.8', 'Type.8', '1999',
        'Footnotes.9', 'Type.9', '2000', 'Footnotes.10', 'Type.10', '2001',
        'Footnotes.11', 'Type.11', '2002', 'Footnotes.12', 'Type.12', '2003',
        'Footnotes.13', 'Type.13', '2004', 'Footnotes.14', 'Type.14', '2005',
        'Footnotes.15', 'Type.15', '2006', 'Footnotes.16', 'Type.16', '2007',
        'Footnotes.17', 'Type.17', '2008', 'Footnotes.18', 'Type.18', '2009',
        'Footnotes.19', 'Type.19', '2010', 'Footnotes.20', 'Type.20', '2011',
        'Footnotes.21', 'Type.21', '2012', 'Footnotes.22', 'Type.22', '2013',
        'Footnotes.23', 'Type.23', '2014', 'Footnotes.24', 'Type.24', '2015',
        'Footnotes.25', 'Type.25', '2016', 'Footnotes.26', 'Type.26', '2017',
        'Footnotes.27', 'Type.27', '2018', 'Footnotes.28', 'Type.28', '2019',
        'Footnotes.29', 'Type.29'],
       dtype='object')}

In [7]:
#Checking number of data types

stats.dtypes.value_counts()

object    93
int64      2
dtype: int64

In [8]:
# Removing unnecessary columns 
for row in stats:
    if "Footnotes" in row:
        del stats[row]
    elif "Type" in row:
        del stats[row]
    elif "2016" in row:
        del stats[row]
    elif "2017" in row:
        del stats[row]
    elif "2018" in row:
        del stats[row]
    elif "2019" in row:
        del stats[row]
        
stats.head(1)

,CountryCode,Country,SeriesCode,MDG,Series,1990,1991,1992,1993,1994,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,4,Afghanistan,567,Y,"Proportion of land area covered by forest, per...",2.1,,,,,...,,,,,2.1,,,,,

In [9]:
#Replacing all empty string and records with only spaces nan
replacing_re = stats.replace(r'^\s*$', np.nan,regex = True)
replacing_re.head(1)

,CountryCode,Country,SeriesCode,MDG,Series,1990,1991,1992,1993,1994,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,4,Afghanistan,567,Y,"Proportion of land area covered by forest, per...",2.1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,2.1,NaN,NaN,NaN,NaN,NaN

In [10]:
#Checking nunique values
stats.nunique()

CountryCode    230
Country        230
SeriesCode       3
MDG              1
Series           3
1990           516
1991           175
1992           199
1993           195
1994           194
1995           194
1996           199
1997           198
1998           204
1999           200
2000           569
2001           200
2002           205
2003           207
2004           208
2005           391
2006           208
2007           206
2008           206
2009           211
2010           387
2011           208
2012             1
2013             1
2014           202
2015             1
dtype: int64

In [11]:
corr = stats.corr()
corr.head(1)

             CountryCode    SeriesCode
CountryCode          1.0 -1.532248e-17

There is a perfect negative relationship between Country code and Series code meaning they are inversely proportional.When on increases the other decreases.

# Number of Countries represented and mising values in,country,series and year

In [12]:
#Checking the number of countries represented
country_name = replacing_re.Country.unique()

print("Number of countries in dataframes =", len(country_name))

Number of countries in dataframes = 230

In [13]:
#sum of null values
print(f"Number of missing values in dataframe = "
      ,replacing_re.isnull().any().sum())

Number of missing values in dataframe =  26

In [14]:
#Checking missing values in the data frame
print(f"Number of missing values in Country =",
      replacing_re["Country"].isnull().any().sum())

Number of missing values in Country = 0

In [15]:
#Checking missing values in series
print(f"Number of missing values in Series =",
      replacing_re["Series"].isnull().any().sum())

Number of missing values in Series = 0

In [16]:
#Creating a variable called year
year = replacing_re[["1990","1991","1992","1993","1994",
                     "1995","1996","1997","1998","1999",
                     "2000","2001","2002","2003","2004",
                     "2005","2006","2007","2008","2009",
                     "2010","2011","2012","2013","2014",
                     "2015"]]

year.head()

,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,2.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,2.1,NaN,NaN,NaN,NaN,NaN
1,2676.9,2493.6,1426.5,1375.1,1320.1,1268.8,1199.1,1114.8,1056.1,832.4,...,1657.5,2280.9,4217.1,6776.6,8470.8,12251.4,NaN,NaN,NaN,NaN
2,0.36,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.46,NaN
3,28.8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,28.3,NaN,NaN,NaN,NaN,NaN
4,7488,3971.4,2387.2,2343.2,1928.8,2086.5,2016.9,1543.8,1752.8,2984.9,...,3865,4477.4,4657.1,4488.4,4415.1,4668.1,NaN,NaN,NaN,NaN

In [17]:
#Checking missing values in series
print(f"Number of missing values in year =",
      year.isnull().any().sum())

Number of missing values in year = 26

In [21]:
stats = replacing_re.fillna(stats["CountryCode"].mean())
stats.head(2)

,CountryCode,Country,SeriesCode,MDG,Series,1990,1991,1992,1993,1994,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,4,Afghanistan,567,Y,"Proportion of land area covered by forest, per...",2.1,439.465,439.465,439.465,439.465,...,439.465,439.465,439.465,439.465,2.1,439.465,439.465217,439.465217,439.465,439.465217
1,4,Afghanistan,749,Y,"Carbon dioxide emissions (CO2), thousand metri...",2676.9,2493.6,1426.5,1375.1,1320.1,...,1657.5,2280.9,4217.1,6776.6,8470.8,12251.4,439.465217,439.465217,439.465,439.465217